tests/darcy_02/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    right
    {
        type            zeroGradient;
    }
    left
    {
        type            fixedValue;
        value           uniform (1e-5 0 0);
    }
}

// ************************************************************************* //
