tests/darcy_02/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// /!\ This is the kinematic pressure (i.e. the pressure divided by the density)
dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
    right
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    left
    {
        type            fixedFluxPressure;
    }
}

// ************************************************************************* //
